; domain
(define (domain orbital)

    (:requirements :typing :fluents)

    (:types
        module - object
    )

    (:predicates
        (linked ?f1 - module ?f2 - module)
    )

    (:functions
        (oxygen ?b - module)
        (power_drain)
    )

    ;; Move a person from a unit f1 to a unit f2
    (:action vent-fast
        :parameters (?f1 - module ?f2 - module)
        :precondition (and (>= (oxygen ?f1) 4) (linked ?f1 ?f2))
        :effect (and(decrease (oxygen ?f1) 4) (increase (oxygen ?f2) 2) (increase (power_drain) 1))
    )

    (:action vent-slow
        :parameters (?f1 - module ?f2 - module)
        :precondition (and (>= (oxygen ?f1) 1) (linked ?f1 ?f2))
        :effect (and(decrease (oxygen ?f1) 1) (increase (oxygen ?f2) 1))
    )

)

; problem
(define (problem farmland_7_mixed)
  (:domain orbital)
  (:objects
    module0 module1 module2 module3 module4 module5 module6 - module
  )
  (:init
    (= (power_drain) 0)
    (= (oxygen module0) 16)
    (= (oxygen module1) 0)
    (= (oxygen module2) 0)
    (= (oxygen module3) 0)
    (= (oxygen module4) 0)
    (= (oxygen module5) 0)
    (= (oxygen module6) 0)
    (linked module0 module1)
    (linked module1 module0)
    (linked module0 module2)
    (linked module2 module0)
    (linked module0 module3)
    (linked module3 module0)
    (linked module3 module4)
    (linked module4 module3)
    (linked module4 module5)
    (linked module5 module4)
    (linked module5 module6)
    (linked module6 module5)
  )
  (:goal
    (and
      (>= (oxygen module1) 1)
      (>= (oxygen module2) 1)
      (>= (oxygen module3) 1)
      (>= (oxygen module4) 1)
      (>= (oxygen module5) 1)
      (>= (oxygen module6) 1)
    )
  )
)

; plan
1. (vent-slow module0 module3)
   changed: (oxygen module0) from 16 to 15, (oxygen module3) from 0 to 1
   goals met: 1 of 6
2. (vent-slow module3 module4)
   changed: (oxygen module3) from 1 to 0, (oxygen module4) from 0 to 1
   goals met: 1 of 6
3. (vent-slow module4 module5)
   changed: (oxygen module4) from 1 to 0, (oxygen module5) from 0 to 1
   goals met: 1 of 6
4. (vent-slow module0 module1)
   changed: (oxygen module0) from 15 to 14, (oxygen module1) from 0 to 1
   goals met: 2 of 6
5. (vent-slow module0 module2)
   changed: (oxygen module0) from 14 to 13, (oxygen module2) from 0 to 1
   goals met: 3 of 6
6. (vent-slow module0 module3)
   changed: (oxygen module0) from 13 to 12, (oxygen module3) from 0 to 1
   goals met: 4 of 6
7. (vent-slow module3 module4)
   changed: (oxygen module3) from 1 to 0, (oxygen module4) from 0 to 1
   goals met: 4 of 6
8. (vent-fast module0 module3)
   changed: (oxygen module0) from 12 to 8, (oxygen module3) from 0 to 2, (power_drain) from 0 to 1
   goals met: 5 of 6
9. (vent-fast module0 module3)
   changed: (oxygen module0) from 8 to 4, (oxygen module3) from 2 to 4, (power_drain) from 1 to 2
   goals met: 5 of 6
10. (vent-slow module5 module6)
   changed: (oxygen module5) from 1 to 0, (oxygen module6) from 0 to 1
   goals met: 5 of 6
11. (vent-slow module4 module5)
   changed: (oxygen module4) from 1 to 0, (oxygen module5) from 0 to 1
   goals met: 5 of 6
12. (vent-slow module3 module4)
   changed: (oxygen module3) from 4 to 3, (oxygen module4) from 0 to 1
   goals met: 6 of 6
